Reports/ВедомостьАмортизацииОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ВедомостьАмортизацииОСНалоговыйУчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоДокументу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДополнительный</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИсходнойПроводки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/СчетаБухгалтерскогоУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СчетаБухгалтерскогоУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаДооценокОС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НалоговыеНазначенияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НалоговыеНазначенияОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСНалоговыйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСНалоговыйУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимостьНУ</Name>
					<Comment>Первоначальная стоимость для НУ (на 01.01.2002 или на момент ввода в эксплуатацию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяГруппаОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппыОсновныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬУчитываетсяКакЗапасНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УДАЛИТЬНеУчитываетсяКакОСНУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостоянияОСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияОСОрганизаций</Name>
			<Comment>(Регл) Регистр, который показывает изменение состояний основных по бух. учету ОС. Данные вносятся только документами. По этому регистру ведется анализ даты принятия к учету, ввода в эксплуатацию, выбытия.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Comment>Дата установки состояния</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВведеноВЭксплуатацию</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОсновныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОсновныеСредства</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ОбъектыСтроительства</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изготовитель</Name>
					<Comment>(Общ) Организация-изготовитель</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автотранспорт</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ВедомостьАмортизацииОСНалоговыйУчет/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
// Настройка периода
Перем НП Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	// не выводим общие
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок.Вставить("Общие", 1);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "Организация", Организация);
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		
		ОтчетПоДокументу = Ложь;
		
	КонецЕсли;
	
	Если ОтчетПоДокументу Тогда
		
		МоментДокумента = Документ.МоментВремени();
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонДата"   , МоментДокумента.Дата);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("НачГраница", МоментДокумента);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КонГраница", МоментДокумента);
		
		Запрос       = Новый Запрос;
		Запрос.УстановитьПараметр("СубконтоОС" , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ХозрасчетныйСубконто.Значение КАК ОС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
		|ГДЕ
		|	ХозрасчетныйСубконто.Вид = &СубконтоОС
		|	И ХозрасчетныйСубконто.Регистратор = &Регистратор";
		СписокОС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОС");
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС = Неопределено Тогда
			
			ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Добавить("ОсновноеСредство");	
			
		КонецЕсли;
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Истина;
			ОтборПоОС.ВидСравнения  = ВидСравнения.ВСписке;         
			ОтборПоОС.Значение.ЗагрузитьЗначения(СписокОС);
			
		КонецЕсли;
		
	Иначе
		
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачДата"   , ОбщийОтчет.ДатаНач);
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонДата"   , КонецДня(ОбщийОтчет.ДатаКон));
		ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачГраница", ОбщийОтчет.ДатаНач);
		
		Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", Неопределено);
			
		Иначе
			
			ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонГраница", КонецДня(ОбщийОтчет.ДатаКон));
			
		КонецЕсли;
	
	КонецЕсли; 
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);
	
	Если ОтчетПоДокументу Тогда
		// Очищается отбор	
		
		ОтборПоОС = ОбщийОтчет.ПостроительОтчета.Отбор.Найти("ОсновноеСредство");
		
		Если ОтборПоОС <> Неопределено Тогда
			
			ОтборПоОС.Использование = Ложь;
			ОтборПоОС.ВидСравнения  = ВидСравнения.Равно;         
			ОтборПоОС.Значение      = Справочники.ОсновныеСредства.ПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;
	
	Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Стоимость.Организация                                   КАК Организация,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Организация)                    КАК ОрганизацияПредставление,
	|	Стоимость.Счет                                          КАК СчетУчета,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Счет)                           КАК СчетУчетаПредставление,
	|	Стоимость.НалоговоеНазначение                           КАК НалоговоеНазначение,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.НалоговоеНазначение)            КАК НалоговоеНазначениеПредставление,
	|	Стоимость.Субконто1                                     КАК ОсновноеСредство,
	|	ПРЕДСТАВЛЕНИЕ(Стоимость.Субконто1)                      КАК ОсновноеСредствоПредставление,
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию                   КАК ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета                         КАК ДатаСнятияСУчета,
	|	СУММА(Стоимость.СуммаНУНачальныйОстаток)                КАК СтоимостьНачальныйОстаток,
	|	СУММА(Стоимость.СуммаНУОборотДт)                        КАК СтоимостьОборотДт,
	|	СУММА(Амортизация.СуммаНУОборотКт)                      КАК АмортизацияОборот,
	|	СУММА(Стоимость.СуммаНУОборотКт)                        КАК СтоимостьОборотКт,
	|	СУММА(Стоимость.СуммаНУКонечныйОстаток)                 КАК СтоимостьКонечныйОстаток,
	|	ПервоначальныеСведения.НалоговаяГруппаОС                КАК НалоговаяГруппаОС,
	|	ПРЕДСТАВЛЕНИЕ(ПервоначальныеСведения.НалоговаяГруппаОС) КАК НалоговаяГруппаОСПредставление,
	|	Стоимость.Субконто1.Код                                 КАК КодОС
	|{ВЫБРАТЬ
	|	Стоимость.Организация.*            КАК Организация,
	|	Стоимость.НалоговоеНазначение      КАК НалоговоеНазначение,
	|	Стоимость.Субконто1                КАК ОсновноеСредство,
	|	Стоимость.Субконто1.Изготовитель   КАК Изготовитель,
	|	Стоимость.Субконто1.НомерПаспорта  КАК НомерПаспорта,
	|	Стоимость.Субконто1.ЗаводскойНомер КАК ЗаводскойНомер,
	|	Стоимость.Субконто1.ДатаВыпуска    КАК ДатаВыпуска,
	|	Стоимость.Субконто1.Модель         КАК Модель,
	|	ДатаВводаВЭксплуатацию             КАК ДатаВводаВЭксплуатацию,
	|	ДатаСнятияСУчета                   КАК ДатаСнятияСУчета,
	|	СчетУчета.*                        КАК СчетУчета,
	|	НалоговаяГруппаОС 				   КАК НалоговаяГруппаОС,
	|	Стоимость.Субконто1.Код            КАК КодОС}
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , ,
	|	                   Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетУчета
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Стоимость
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				НалоговыеНазначенияОС.Организация         КАК Организация,
	|				НалоговыеНазначенияОС.ОсновноеСредство    КАК ОсновноеСредство,
	|				НалоговыеНазначенияОС.НалоговоеНазначение КАК НалоговоеНазначение,
	|				ВЫБОР
	|					КОГДА НалоговыеНазначенияОС.НалоговоеНазначение = &НеОблНеХоз
	|						ТОГДА NULL
	|					ИНАЧЕ ПервоначальныеСведения.НалоговаяГруппаОС
	|				КОНЕЦ 			                   		  КАК НалоговаяГруппаОС
	|			ИЗ
	|				РегистрСведений.НалоговыеНазначенияОС.СрезПоследних(&ДатаКон,
	|                               Организация = &Организация
	|				                {ОсновноеСредство КАК ОсновноеСредство}) КАК НалоговыеНазначенияОС
	|					ЛЕВОЕ СОЕДИНЕНИЕ 
	|						РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|						                &ДатаКон, Организация = &Организация
	|										{ОсновноеСредство КАК ОсновноеСредство}) КАК ПервоначальныеСведения
	|					ПО НалоговыеНазначенияОС.Организация = ПервоначальныеСведения.Организация
	|					   И НалоговыеНазначенияОС.ОсновноеСредство = ПервоначальныеСведения.ОсновноеСредство) КАК ПервоначальныеСведения
	|		ПО Стоимость.Организация = ПервоначальныеСведения.Организация
	|			И Стоимость.НалоговоеНазначение = ПервоначальныеСведения.НалоговоеНазначение
	|			И Стоимость.Субконто1 = ПервоначальныеСведения.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			(ВЫБРАТЬ
	|				СостоянияОС.Организация      КАК Организация,
	|				СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеВвода
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|				МАКСИМУМ(ВЫБОР
	|						 	КОГДА СостоянияОС.Состояние = &СостояниеСнятияСУчета
	|								ТОГДА СостоянияОС.ДатаСостояния
	|						 	ИНАЧЕ NULL
	|					     КОНЕЦ) КАК ДатаСнятияСУчета
	|			ИЗ
	|				РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОС
	|			ГДЕ
	|				СостоянияОС.Организация = &Организация
	|			{ГДЕ
	|				СостоянияОС.ОсновноеСредство}
	|		
	|			СГРУППИРОВАТЬ ПО
	|				СостоянияОС.Организация,
	|				СостоянияОС.ОсновноеСредство) КАК РегСостоянияОС
	|		ПО Стоимость.Организация = РегСостоянияОС.Организация
	|			И Стоимость.Субконто1 = РегСостоянияОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|		                       &НачГраница,
	|		                       &КонГраница, , ,
	|		                       Счет В
	|		                       	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|		                         	                &НачДата, Организация = &Организация
	|		                         	                {ОсновноеСредство.* КАК ОсновноеСредство}) КАК СчетаУчета
	|		
	|		                         ОБЪЕДИНИТЬ
	|		
	|		                         ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		                         	СчетаУчета.СчетНачисленияАмортизации
	|		                         ИЗ
	|		                         	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаУчета
	|		                         ГДЕ
	|		                         	СчетаУчета.Период МЕЖДУ &НачДата И &КонДата
	|		                         	 И СчетаУчета.Организация = &Организация
	|		                         {ГДЕ
	|		                         	СчетаУчета.ОсновноеСредство.* КАК ОсновноеСредство}),
	|		                       &СубконтоОС,
	|		                       Организация = &Организация
	|		                       {ВЫРАЗИТЬ(Субконто1 КАК Справочник.ОсновныеСредства).* КАК ОсновноеСредство}) КАК Амортизация
	|		ПО Стоимость.Организация = Амортизация.Организация
	|			И Стоимость.Субконто1 = Амортизация.Субконто1
	|{ГДЕ
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию    КАК ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета          КАК ДатаСнятияСУчета,
	|	ПервоначальныеСведения.НалоговаяГруппаОС КАК НалоговаяГруппаОС}
	|
	|СГРУППИРОВАТЬ ПО
	|	Стоимость.Организация,
	|	Стоимость.НалоговоеНазначение,
	|	Стоимость.Субконто1,
	|	РегСостоянияОС.ДатаВводаВЭксплуатацию,
	|	РегСостоянияОС.ДатаСнятияСУчета,
	|	Стоимость.Счет,
	|	ПервоначальныеСведения.НалоговаяГруппаОС
	|{УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	НалоговоеНазначение,
	|	ОсновноеСредство,
	|	СтоимостьНачальныйОстаток,
	|	СтоимостьОборотДт,
	|	СтоимостьКонечныйОстаток,
	|	АмортизацияОборот,
	|	СтоимостьОборотКт,
	|	СчетУчета.*,
	|	НалоговаяГруппаОС.*}
	|ИТОГИ
	|	СУММА(СтоимостьНачальныйОстаток),
	|	СУММА(СтоимостьОборотДт),
	|	СУММА(АмортизацияОборот),
	|	СУММА(СтоимостьОборотКт),
	|	СУММА(СтоимостьКонечныйОстаток)
	|ПО
	|	ОБЩИЕ,
	|	Организация,
	|	НалоговоеНазначение,
	|	НалоговаяГруппаОС
	|{ИТОГИ ПО
	|	Организация,
	|	СчетУчета.*,
	|	НалоговоеНазначение,
	|	ОсновноеСредство,
	|	НалоговаяГруппаОС}
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить( "Организация",                    "Организация");
	СтруктураПредставлениеПолей.Вставить( "ОрганизацияГоловнаяОрганизация", "Головная организация");
	СтруктураПредставлениеПолей.Вставить( "ОрганизацияЮрФизЛицо",           "Юр. / физ. лицо");
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",               "Основное средство");
	СтруктураПредставлениеПолей.Вставить( "Изготовитель",                   "Изготовитель");
	СтруктураПредставлениеПолей.Вставить( "НомерПаспорта",                  "Номер паспорта ОС");
	СтруктураПредставлениеПолей.Вставить( "ЗаводскойНомер",                 "Заводской номер ОС");
	СтруктураПредставлениеПолей.Вставить( "ДатаВыпуска",                    "Дата выпуска (постройки)");
	СтруктураПредставлениеПолей.Вставить( "Модель",                         "Модель, тип, марка");
	СтруктураПредставлениеПолей.Вставить( "ДатаВводаВЭксплуатацию",         "Дата ввода в эксплуатацию");
	СтруктураПредставлениеПолей.Вставить( "ДатаСнятияСУчета",         		"Дата снятия с учета");
	СтруктураПредставлениеПолей.Вставить( "СчетУчета",         				"Счет учета");
	СтруктураПредставлениеПолей.Вставить( "ВидНалоговойДеятельности",       "Вид налоговой деятельности");
	СтруктураПредставлениеПолей.Вставить( "НалоговаяГруппаОС",              "Налоговая группа");
	СтруктураПредставлениеПолей.Вставить( "КодОС",                          "Код ОС");
	
	СтруктураПредставлениеПолей.Вставить( "СтоимостьНачальныйОстаток",      "Стоимость на начало периода");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотДт",              "Стоимость (приход)");
	СтруктураПредставлениеПолей.Вставить( "АмортизацияОборот",              "Амортизация за период");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьОборотКт",              "Стоимость (расход)");
	СтруктураПредставлениеПолей.Вставить( "СтоимостьКонечныйОстаток",       "Стоимость на конец периода");

	
	
	ПостроительОтчета.Текст     = Текст;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьНачальныйОстаток",      "Стоимость на начало периода",       Истина, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотДт",              "Стоимость (приход)",                Истина, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "АмортизацияОборот",              "Амортизация за период",             Истина, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьОборотКт",              "Стоимость (расход)",                Ложь, 	"ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СтоимостьКонечныйОстаток",       "Стоимость на конец периода",        Ложь, 	"ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("ОсновноеСредство");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ПостроительОтчета.Параметры.Вставить( "СостояниеВвода"       , Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	ПостроительОтчета.Параметры.Вставить( "СостояниеСнятияСУчета", Перечисления.СостоянияОС.СнятоСУчета);
	ПостроительОтчета.Параметры.Вставить( "СубконтоОС"           , ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	ПостроительОтчета.Параметры.Вставить( "НеОблНеХоз"           , Справочники.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность);
	
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.РаскрашиватьИзмерения     = Истина;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;
	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Добавляет в структуру общие для всех отчетов параметры настройки
//
// Параметры:
//	Нет.
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкиПостроителя", ОбщийОтчет.ПостроительОтчета.ПолучитьНастройки());
	СтруктураНастроек.Вставить("Показатели", ОбщийОтчет.Показатели.Выгрузить());
	СтруктураНастроек.Вставить("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураНастроек.Вставить("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураНастроек.Вставить("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураНастроек.Вставить("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураНастроек.Вставить("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
	Возврат СтруктураНастроек;
	
КонецФункции // СформироватьСтруктуруДляСохраненияНастроек()()

// Заполняет из структуры настроек общие параметры отчетов
//
// Параметры:
//	Нет.
//
Процедура ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ПоказыватьЗаголовок) Экспорт
	Перем ТабПоказатели;
	
	Если ТипЗнч(ОбщийОтчет.СохраненныеНастройки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.УстановитьНастройки(СтруктураСНастройками.НастройкиПостроителя);
	
	СтруктураСНастройками.Свойство("Показатели", ТабПоказатели);
	Если ТипЗнч(ТабПоказатели) = Тип("ТаблицаЗначений") Тогда
		ОбщийОтчет.Показатели.Загрузить(ТабПоказатели);
	КонецЕсли;
	
	СтруктураСНастройками.Свойство("ВыводитьДополнительныеПоляВОтдельнойКолонке", ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке);
	СтруктураСНастройками.Свойство("ВыводитьИтогиПоВсемУровням", ОбщийОтчет.ВыводитьИтогиПоВсемУровням);
	СтруктураСНастройками.Свойство("ВыводитьПоказателиВСтроку", ОбщийОтчет.ВыводитьПоказателиВСтроку);
	СтруктураСНастройками.Свойство("РаскрашиватьИзмерения", ОбщийОтчет.РаскрашиватьИзмерения);
	СтруктураСНастройками.Свойство("ЗаголовокПомечен", ОбщийОтчет.ПоказыватьЗаголовок);
	
КонецПроцедуры // ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки)()

ОбщийОтчет.ИмяРегистра          = "СтоимостьОС";
ОбщийОтчет.мНазваниеОтчета      = "Ведомость по амортизации ОС";
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.мРежимВводаПериода   = 0;

#КонецЕсли
